; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   yellow_block_1 blue_block_1 purple_block_1 brown_block_1 grey_block_1 green_block_1 white_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable blue_block_1) (ontable purple_block_1) (on brown_block_1 purple_block_1) (on grey_block_1 brown_block_1) (on green_block_1 blue_block_1) (on white_block_1 grey_block_1) (clear yellow_block_1) (clear green_block_1) (clear white_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on green_block_1 purple_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack white_block_1 grey_block_1)
   deleted: (on white_block_1 grey_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear grey_block_1)
   goals met: 0 of 1
2. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1)
   goals met: 0 of 1
3. (unstack grey_block_1 brown_block_1)
   deleted: (on grey_block_1 brown_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear brown_block_1)
   goals met: 0 of 1
4. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 0 of 1
5. (unstack brown_block_1 purple_block_1)
   deleted: (on brown_block_1 purple_block_1) (clear brown_block_1) (handempty)
   added: (holding brown_block_1) (clear purple_block_1)
   goals met: 0 of 1
6. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 0 of 1
7. (unstack green_block_1 blue_block_1)
   deleted: (on green_block_1 blue_block_1) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear blue_block_1)
   goals met: 0 of 1
8. (stack green_block_1 purple_block_1)
   deleted: (clear purple_block_1) (holding green_block_1)
   added: (handempty) (clear green_block_1) (on green_block_1 purple_block_1)
   goals met: 1 of 1
